def MakingLookUpTable():
    EncryptCode_Capital={'A':'A̴̶͇͇̩͍͔͚͖̥͉̟͆͗̄͗̽ͩ̌ͤ͋̐̿̀ͤͭ̔̚͟͠ͅ', 'B':'Ḃ́̅̈́', 'C':'C̢͗ͤ͆̂̊̓̃̆͆̄̑̈͛ͭ̏̇͏̩͕̳̫͙͘', 'D':'D̆ͧ̏̊̎͐̃̋̾ͬ̌͑̍', 'E':'E̵̘͚͓̻̬̖̞ͬ̇ͭͧ̔̀̃͐͆́̚̚͟͝', 'F':'F̆̾ͨ̄́̿ͪ͐͋ͨͨ̇͐͛', 'G':'Ģ̙̱̘̙̩̣͈̩̖̟̙̩̼͎͇̠͓̳͙̎ͩ͗̑̊̌ͮͮͬͤ̈ͣ͊́̀̍͜͠','H':'H͖̩̤̟ͫ̇̿̈́͊̑̊̈́̿͂ͤ̏̋̔̀͝', 'I':'Iͧ̉ͭ́̚͏̧̲͕͕͚','J':'J͋̑̓͌͑̋ͣͭ̊͐', 'K':'K̷̲̯͚̥ͧ͒͒͆̿ͦ͋̉͋̾̋͜͜͝', 'L':'L̴̵̡͕̘̱͕̬͔̹͎̫͖̠͔ͬ͒ͮ͑̂̍̂̑͌̅ͯ͒͛ͭ̓͗́̚͘', 'M':'M̻͔̺͚͈̬̍ͤ͊̓̅͝', 'N':'N͐͒̾ͣͣͫ͒ͩ̂͋ͮͫ͊͗̀', 'O':'O̔͂͆̂͑ͩͧ͌̋ͫ̇́̿', 'P':'P̸̥̺͕ͣ̾͑͆̏̽͆ͦ̔̓͊͒͌ͣͭ͋̃͗̄́','Q':'Q̉̄̈́͗̽ͣ̄ͬͥ́̄','R':'Ṙ͋','S':'Sͩͦ̆̇̐̕͢', 'T':'T̨͛̄ͩ̑͛', 'U':'Ǘ͛ͬ̀͆ͪ̚', 'V':'V̛̐͊ͪ̍ͮ̓̑͛̽̅̋̃͂ͣͮ̚͏̞̹̟̺̩̖̹̙̞̞͚̕͜', 'W':'W͆ͨ̎̂̆͒̓͛̊͆̊͆̐́͌̒', 'X':'Xͪ̌ͦ͊ͣͨ͊̃͑', 'Y':'Y̨̓̽ͬ̏̕', 'Z':'Ź͐ͥ͐'}
    EncryptCode_Small={'a':'ą̌̀̉̏̇͌ͣ͊̾́', 'b':'b̓̏̅̃̿ͬ͗', 'c':'c̉ͣ̈́̇̕','d':'dͫ̀̎ͬ͒ͥ̅͂̅̎̾', 'e':'ȩ͒̏̿̏̇̑́', 'f':'f̡͙̯̺̗̩̝̦̹̹̗̱̘̳̖̞̟̔̎̋̑̾̾̔̔ͭ͗ͅ','g':'g͋̂̓͐̇̑','h':'h̓͋ͦ̋','i':'ī̦̰̜̠͈̘̼͉͓̺͓̩̯͎͚̻̙̦ͨͦ̏ͤ̀̏̀̀̀','j':'j͉̼̝̥͇̭̬͓̮͙̥̥̖̳̳̖ͧ̉̔̑́͟','k':'k̋͛͊̔͒ͮͪ̍̎̌͒̋͒ͭ̊','l':'l͒̈̔ͦ͋̊','m':'m̓','n':'n͗̇͛̉͏̛̥͔̲͉̩̱͓͙͖͓','o':'o̿̅̓ͮ̓͗̃ͪͤ̊͋͆ͣ̏', 'p':'pͭͦ̍͑͑ͯ̃ͯ̋͗̓ͨ́͗̓̄́̚̕͟','q':'q͛̓̎̑͂̎ͬ̓ͣ͂̎ͬ̓͋ͪ','r':'ŗ͕̣̜͙̮ͦ̏̆̇̇́͡','s':'s̱̀͛̑͛͆̾͂̈̊ͤ́ͫͫͪ̄̚̕͟͢','t':'t͗ͯ͊ͧ͑ͩ','u':'uͨ̾͋','v':'v̓͌͛̑̐́͟','w':'w̞̞̞̠̤̞̤̗̘̝̦̯̬̱͇̗̦͔͌ͭ͊̉̋́͌ͨ̀͘','x':'x̧̧̦̥̻̰̜͈̼̻͎̤͙̦͈͙͓̦ͬ́̿̉͗','y':'y','z':'z̛̘̺̮̣̤̮̻̜̰̳͙͍̖ͪͦ̇̃̋̄͐͋͌͛͑̋̆͌̽̐́͟'}
    return EncryptCode_Capital, EncryptCode_Small

def Encrypt(msg, CapitalCodebook, SmallCodebook):
    for c in msg:
        if c in CapitalCodebook:
            msg = msg.replace(c, CapitalCodebook[c])
        elif c in SmallCodebook:
            msg = msg.replace(c, SmallCodebook[c])

    return msg


if __name__ == '__main__':

    msg = input("Input$> ")
    Encrypt01, Encrypt02 = MakingLookUpTable()
    print(Encrypt(msg, Encrypt01, Encrypt02))